7FULL/SIDERA/src/samd21_telemetry/src/samd21_telemetry_integration.cpp
#include "samd21_telemetry_integration.h"

// Global instance
SAMD21TelemetryIntegration* g_samd21_telemetry = nullptr;

SAMD21TelemetryIntegration::SAMD21TelemetryIntegration() :
    telemetry(nullptr),
    spi_slave(nullptr),
    initialized(false),
    radio_configured(false),
    ground_station_connected(false),
    current_radio_profile(0),
    last_radio_update(0),
    last_data_transmission(0),
    last_heartbeat(0),
    last_status_update(0),
    last_rssi_update(0),
    last_master_communication(0),
    ground_command_callback(nullptr),
    connection_status_callback(nullptr),
    data_received_callback(nullptr),
    error_callback(nullptr)
{
    memset(&tel_data, 0, sizeof(tel_data));
    memset(&master_data, 0, sizeof(master_data));
    memset(&tx_queue, 0, sizeof(tx_queue));
    memset(&stats, 0, sizeof(stats));
    
    initialize_radio_profiles();
}

SAMD21TelemetryIntegration::~SAMD21TelemetryIntegration()
{
    if (telemetry) delete telemetry;
    if (spi_slave) delete spi_slave;
}

int8_t SAMD21TelemetryIntegration::begin()
{
    initialize_pins();
    configure_uart();
    
    if (initialize_radio() != 0) {
        return -1;
    }
    
    // Initialize SPI slave communication
    spi_slave = new SPISlave();
    if (spi_slave->begin(TEL_SPI_CS_PIN) != 0) {
        return -2;
    }
    
    initialized = true;
    
    // Start with default radio profile
    configure_radio_profile(0);
    
    // Set initial status
    tel_data.radio_status.radio_ready = true;
    tel_data.radio_status.timestamp = millis();
    
    return 0;
}

int8_t SAMD21TelemetryIntegration::initialize_radio()
{
    // Initialize telemetry system with Serial1 (radio UART)
    telemetry = new TelemetrySystem(Serial1, TEL_RADIO_ENABLE_PIN, TEL_RADIO_RESET_PIN);
    
    // Configure default telemetry settings
    TelemetryConfig config = TelemetryUtils::Templates::LONG_RANGE_CONFIG;
    config.radio.frequency = 433000000; // 433 MHz
    config.radio.power_level = 80; // 80% power
    strcpy(config.radio.call_sign, "ROCKET");
    
    if (telemetry->begin(config, 2) != 0) { // System ID = 2 (telemetry)
        if (error_callback) {
            error_callback("Radio initialization failed");
        }
        return -1;
    }
    
    // Set callbacks
    telemetry->set_packet_received_callback([](const TelemetryPacket& packet) {
        if (g_samd21_telemetry && g_samd21_telemetry->data_received_callback) {
            g_samd21_telemetry->data_received_callback(packet);
        }
    });
    
    telemetry->set_connection_status_callback([](bool connected) {
        if (g_samd21_telemetry) {
            g_samd21_telemetry->ground_station_connected = connected;
            if (g_samd21_telemetry->connection_status_callback) {
                g_samd21_telemetry->connection_status_callback(connected);
            }
        }
    });
    
    current_config = config;
    radio_configured = true;
    
    return 0;
}

int8_t SAMD21TelemetryIntegration::configure_radio_profile(uint8_t profile_id)
{
    if (profile_id >= 4 || !telemetry) return -1;
    
    const RadioProfile& profile = radio_profiles[profile_id];
    
    RadioConfig radio_config;
    radio_config.frequency = profile.frequency;
    radio_config.power_level = profile.power_level;
    radio_config.data_rate = profile.data_rate;
    radio_config.use_encryption = profile.use_encryption;
    radio_config.use_fec = profile.use_fec;
    
    if (telemetry->configure_radio(radio_config) != 0) {
        return -2;
    }
    
    current_radio_profile = profile_id;
    return 0;
}

void SAMD21TelemetryIntegration::update()
{
    uint32_t current_time = millis();
    
    // Update radio communication (high frequency)
    if (current_time - last_radio_update >= TEL_RADIO_UPDATE_RATE) {
        update_radio_communication();
        last_radio_update = current_time;
    }
    
    // Update master communication
    update_master_communication();
    
    // Update transmission queue
    update_transmission_queue();
    
    // Update connection status
    update_connection_status();
    
    // Send heartbeat
    if (current_time - last_heartbeat >= TEL_HEARTBEAT_RATE) {
        if (telemetry) {
            telemetry->send_heartbeat();
        }
        last_heartbeat = current_time;
    }
    
    // Update RSSI
    if (current_time - last_rssi_update >= TEL_RSSI_UPDATE_RATE) {
        if (telemetry) {
            int8_t rssi = telemetry->get_rssi();
            tel_data.radio_status.rssi = rssi;
            tel_data.radio_status.link_quality = calculate_link_quality(rssi, 
                tel_data.radio_status.packets_lost);
        }
        last_rssi_update = current_time;
    }
    
    // Update statistics
    update_statistics();
}

void SAMD21TelemetryIntegration::update_radio_communication()
{
    if (!telemetry) return;
    
    // Update telemetry system
    telemetry->update();
    
    // Process incoming packets
    process_incoming_packets();
    
    // Process ground commands
    process_ground_commands();
    
    // Update radio status
    update_radio_status();
}

void SAMD21TelemetryIntegration::update_master_communication()
{
    // Process SPI communication with master
    if (spi_slave && spi_slave->is_data_available()) {
        uint8_t received_data[128];
        uint16_t length = spi_slave->read_buffer(received_data, sizeof(received_data));
        
        if (length > 0) {
            handle_spi_received_data(received_data, length);
            last_master_communication = millis();
        }
    }
    
    // Check for communication timeout
    if (millis() - last_master_communication > TEL_CONNECTION_TIMEOUT) {
        // Master communication timeout - could trigger emergency mode
    }
}

void SAMD21TelemetryIntegration::update_transmission_queue()
{
    uint32_t current_time = millis();
    
    // Process queued transmissions
    if (current_time - last_data_transmission >= TEL_DATA_TX_RATE) {
        transmit_queued_packets();
        last_data_transmission = current_time;
    }
}

void SAMD21TelemetryIntegration::update_connection_status()
{
    // Update connection status based on last contact time
    uint32_t time_since_contact = millis() - tel_data.radio_status.last_contact_time;
    
    if (time_since_contact > TEL_CONNECTION_TIMEOUT) {
        if (ground_station_connected) {
            ground_station_connected = false;
            tel_data.radio_status.connected_to_ground = false;
            
