7FULL/SIDERA/src/samd21_telemetry/src/samd21_telemetry_integration.cpp
            if (connection_status_callback) {
                connection_status_callback(false);
            }
        }
    }
}

void SAMD21TelemetryIntegration::update_statistics()
{
    stats.uptime = millis();
    
    if (tel_data.radio_status.packets_sent > 0) {
        tel_data.radio_status.connection_time = millis() - stats.uptime;
    }
}

int8_t SAMD21TelemetryIntegration::process_incoming_packets()
{
    if (!telemetry || !telemetry->has_pending_packets()) {
        return 0;
    }
    
    while (telemetry->has_pending_packets()) {
        TelemetryPacket packet = telemetry->get_next_packet();
        
        if (handle_received_packet(packet) == 0) {
            tel_data.radio_status.packets_received++;
            tel_data.radio_status.last_contact_time = millis();
            
            if (!ground_station_connected) {
                ground_station_connected = true;
                tel_data.radio_status.connected_to_ground = true;
                
                if (connection_status_callback) {
                    connection_status_callback(true);
                }
            }
        }
    }
    
    return 0;
}

int8_t SAMD21TelemetryIntegration::handle_received_packet(const TelemetryPacket& packet)
{
    switch (packet.header.packet_type) {
        case TELEM_PKT_COMMAND:
            // Handle ground command
            if (packet.header.payload_length >= sizeof(TelemetryCommand)) {
                TelemetryCommand command;
                memcpy(&command, packet.payload, sizeof(command));
                execute_ground_command((GroundCommand)command.command_id, command.parameters);
            }
            break;
            
        case TELEM_PKT_PING:
            // Respond to ping
            telemetry->send_acknowledgment(packet.header.sequence_number);
            break;
            
        case TELEM_PKT_CONFIG:
            // Handle configuration update
            break;
            
        case TELEM_PKT_ACK:
            // Handle acknowledgment
            break;
            
        default:
            break;
    }
    
    return 0;
}

int8_t SAMD21TelemetryIntegration::transmit_flight_data(const void* data, uint16_t length)
{
    if (!telemetry || !ground_station_connected) return -1;
    
    int8_t result = telemetry->send_packet(TELEM_PKT_FLIGHT_DATA, data, length, TELEM_PRIORITY_HIGH);
    
    if (result == 0) {
        tel_data.transmission_stats.flight_data_sent++;
        tel_data.radio_status.packets_sent++;
    } else {
        tel_data.radio_status.packets_lost++;
    }
    
    return result;
}

int8_t SAMD21TelemetryIntegration::transmit_gps_data(const void* data, uint16_t length)
{
    if (!telemetry || !ground_station_connected) return -1;
    
    int8_t result = telemetry->send_packet(TELEM_PKT_GPS_DATA, data, length, TELEM_PRIORITY_NORMAL);
    
    if (result == 0) {
        tel_data.transmission_stats.gps_data_sent++;
        tel_data.radio_status.packets_sent++;
    } else {
        tel_data.radio_status.packets_lost++;
    }
    
    return result;
}

int8_t SAMD21TelemetryIntegration::transmit_sensor_data(const void* data, uint16_t length)
{
    if (!telemetry || !ground_station_connected) return -1;
    
    int8_t result = telemetry->send_packet(TELEM_PKT_SENSOR_DATA, data, length, TELEM_PRIORITY_NORMAL);
    
    if (result == 0) {
        tel_data.transmission_stats.sensor_data_sent++;
        tel_data.radio_status.packets_sent++;
    } else {
        tel_data.radio_status.packets_lost++;
    }
    
    return result;
}

int8_t SAMD21TelemetryIntegration::transmit_system_status(const void* data, uint16_t length)
{
    if (!telemetry || !ground_station_connected) return -1;
    
    int8_t result = telemetry->send_packet(TELEM_PKT_SYSTEM_STATUS, data, length, TELEM_PRIORITY_LOW);
    
    if (result == 0) {
        tel_data.transmission_stats.status_data_sent++;
        tel_data.radio_status.packets_sent++;
    } else {
        tel_data.radio_status.packets_lost++;
    }
    
    return result;
}

int8_t SAMD21TelemetryIntegration::transmit_emergency_data(const void* data, uint16_t length)
{
    if (!telemetry) return -1;
    
    int8_t result = telemetry->send_emergency_packet(data, length);
    
    if (result == 0) {
        tel_data.transmission_stats.emergency_data_sent++;
        tel_data.radio_status.packets_sent++;
    } else {
        tel_data.radio_status.packets_lost++;
    }
    
    return result;
}

int8_t SAMD21TelemetryIntegration::process_ground_commands()
{
    // Check for pending commands from telemetry system
    while (telemetry && telemetry->has_pending_packets()) {
        TelemetryCommand command = telemetry->get_next_command();
        
        if (validate_ground_command((GroundCommand)command.command_id, command.parameters)) {
            execute_ground_command((GroundCommand)command.command_id, command.parameters);
            
            // Send acknowledgment
            telemetry->send_acknowledgment(0, true); // Positive ACK
        } else {
            // Send negative acknowledgment
            telemetry->send_acknowledgment(0, false); // Negative ACK
        }
    }
    
    return 0;
}

void SAMD21TelemetryIntegration::execute_ground_command(GroundCommand command, const uint8_t* parameters)
{
    switch (command) {
        case CMD_ARM_SYSTEM:
            // Forward to master processor
            forward_ground_command_to_master(command, parameters);
            break;
            
        case CMD_DISARM_SYSTEM:
            forward_ground_command_to_master(command, parameters);
            break;
            
        case CMD_DEPLOY_DROGUE:
            forward_ground_command_to_master(command, parameters);
            break;
            
        case CMD_DEPLOY_MAIN:
            forward_ground_command_to_master(command, parameters);
            break;
            
        case CMD_ABORT_FLIGHT:
            forward_ground_command_to_master(command, parameters);
            activate_emergency_mode();
            break;
            
        case CMD_SET_PARAMETER:
            // Handle parameter setting locally or forward to master
            break;
            
        case CMD_REQUEST_DATA:
            // Send requested data type
            break;
            
        case CMD_EMERGENCY_STOP:
            activate_emergency_mode();
            forward_ground_command_to_master(command, parameters);
            break;
            
        default:
            // Unknown command
            break;
    }
    
    // Call callback if set
    if (ground_command_callback) {
        ground_command_callback(command, parameters);
    }
    
    stats.command_executions++;
}

bool SAMD21TelemetryIntegration::validate_ground_command(GroundCommand command, const uint8_t* parameters)
{
    // Basic command validation
    switch (command) {
        case CMD_ARM_SYSTEM:
        case CMD_DISARM_SYSTEM:
        case CMD_DEPLOY_DROGUE:
        case CMD_DEPLOY_MAIN:
        case CMD_ABORT_FLIGHT:
        case CMD_REQUEST_DATA:
        case CMD_EMERGENCY_STOP:
            return true; // These commands are always valid
            
        case CMD_SET_PARAMETER:
            // Validate parameter setting command
            return (parameters != nullptr);
            
        default:
            return false; // Unknown command
    }
}

int8_t SAMD21TelemetryIntegration::forward_ground_command_to_master(GroundCommand command, const uint8_t* parameters)
{
    if (!spi_slave) return -1;
    
    uint8_t command_data[32];
    command_data[0] = 0x10; // Command packet type
    command_data[1] = (uint8_t)command;
    
    if (parameters) {
        memcpy(&command_data[2], parameters, 16); // Copy up to 16 parameter bytes
    }
    
