7FULL/SIDERA/src/samd21_telemetry/src/samd21_telemetry_integration.cpp
    return spi_slave->send_response(command_data, 18);
}

void SAMD21TelemetryIntegration::handle_spi_received_data(const uint8_t* data, uint16_t length)
{
    if (length < 1) return;
    
    uint8_t packet_type = data[0];
    
    switch (packet_type) {
        case 0x01: // Flight data from master
            if (length >= sizeof(master_data.flight_data)) {
                memcpy(master_data.flight_data, &data[1], sizeof(master_data.flight_data));
                master_data.flight_data_ready = true;
                
                // Automatically transmit flight data
                transmit_flight_data(master_data.flight_data, sizeof(master_data.flight_data));
            }
            break;
            
        case 0x02: // GPS data from master
            if (length >= sizeof(master_data.gps_data)) {
                memcpy(master_data.gps_data, &data[1], sizeof(master_data.gps_data));
                master_data.gps_data_ready = true;
                
                // Automatically transmit GPS data
                transmit_gps_data(master_data.gps_data, sizeof(master_data.gps_data));
            }
            break;
            
        case 0x03: // Sensor data from master
            if (length >= sizeof(master_data.sensor_data)) {
                memcpy(master_data.sensor_data, &data[1], sizeof(master_data.sensor_data));
                master_data.sensor_data_ready = true;
                
                // Automatically transmit sensor data
                transmit_sensor_data(master_data.sensor_data, sizeof(master_data.sensor_data));
            }
            break;
            
        case 0x04: // System status from master
            if (length >= sizeof(master_data.system_status)) {
                memcpy(master_data.system_status, &data[1], sizeof(master_data.system_status));
                master_data.status_data_ready = true;
                
                // Automatically transmit system status
                transmit_system_status(master_data.system_status, sizeof(master_data.system_status));
            }
            break;
            
        case 0x05: // Request telemetry status
            send_telemetry_status_to_master();
            break;
    }
    
    master_data.last_update_time = millis();
}

int8_t SAMD21TelemetryIntegration::send_telemetry_status_to_master()
{
    if (!spi_slave) return -1;
    
    uint8_t status_data[32];
    uint16_t offset = 0;
    
    status_data[offset++] = 0x01; // Status response type
    status_data[offset++] = ground_station_connected ? 1 : 0;
    status_data[offset++] = (uint8_t)tel_data.radio_status.rssi;
    status_data[offset++] = tel_data.radio_status.link_quality;
    
    memcpy(&status_data[offset], &tel_data.radio_status.packets_sent, sizeof(uint32_t));
    offset += sizeof(uint32_t);
    memcpy(&status_data[offset], &tel_data.radio_status.packets_received, sizeof(uint32_t));
    offset += sizeof(uint32_t);
    memcpy(&status_data[offset], &tel_data.radio_status.packets_lost, sizeof(uint32_t));
    offset += sizeof(uint32_t);
    
    return spi_slave->send_response(status_data, offset);
}

int8_t SAMD21TelemetryIntegration::transmit_queued_packets()
{
    int8_t packets_sent = 0;
    
    while (tx_queue.count > 0 && packets_sent < 5) { // Limit to 5 packets per cycle
        TelemetryPacket packet;
        if (dequeue_packet(packet)) {
            if (telemetry->send_packet(packet.header.packet_type, 
                                     packet.payload, 
                                     packet.header.payload_length,
                                     packet.header.priority) == 0) {
                packets_sent++;
            } else {
                // Re-queue packet for retry if transmission failed
                if (packet.retry_count < 3) {
                    packet.retry_count++;
                    enqueue_packet(packet);
                }
            }
        }
    }
    
    return packets_sent;
}

bool SAMD21TelemetryIntegration::enqueue_packet(const TelemetryPacket& packet)
{
    if (tx_queue.count >= TEL_MAX_PACKET_BUFFER) {
        return false; // Queue full
    }
    
    tx_queue.packets[tx_queue.head] = packet;
    tx_queue.head = (tx_queue.head + 1) % TEL_MAX_PACKET_BUFFER;
    tx_queue.count++;
    
    return true;
}

bool SAMD21TelemetryIntegration::dequeue_packet(TelemetryPacket& packet)
{
    if (tx_queue.count == 0) {
        return false; // Queue empty
    }
    
    packet = tx_queue.packets[tx_queue.tail];
    tx_queue.tail = (tx_queue.tail + 1) % TEL_MAX_PACKET_BUFFER;
    tx_queue.count--;
    
    return true;
}

int8_t SAMD21TelemetryIntegration::activate_emergency_mode()
{
    // Switch to emergency radio profile
    configure_radio_profile(3); // Emergency profile
    
    // Send emergency beacon
    send_emergency_beacon();
    
    // Enable continuous transmission mode
    if (telemetry) {
        telemetry->set_transmission_mode(TELEM_MODE_CONTINUOUS);
    }
    
    return 0;
}

int8_t SAMD21TelemetryIntegration::send_emergency_beacon()
{
    if (!telemetry) return -1;
    
    uint8_t emergency_data[32];
    emergency_data[0] = 0xFF; // Emergency beacon identifier
    emergency_data[1] = 0x01; // Emergency type: general emergency
    
    uint32_t timestamp = millis();
    memcpy(&emergency_data[2], &timestamp, sizeof(timestamp));
    
    return telemetry->send_emergency_packet(emergency_data, 6);
}

void SAMD21TelemetryIntegration::update_radio_status()
{
    tel_data.radio_status.radio_ready = (telemetry != nullptr && radio_configured);
    tel_data.radio_status.timestamp = millis();
    
    if (telemetry) {
        tel_data.radio_status.rssi = telemetry->get_rssi();
        tel_data.radio_status.link_quality = (uint8_t)(telemetry->get_link_quality() * 100);
    }
}

uint8_t SAMD21TelemetryIntegration::calculate_link_quality(int8_t rssi, uint32_t packet_loss_rate)
{
    // Simple link quality calculation based on RSSI and packet loss
    uint8_t rssi_quality = 0;
    
    if (rssi > -50) rssi_quality = 100;
    else if (rssi > -60) rssi_quality = 80;
    else if (rssi > -70) rssi_quality = 60;
    else if (rssi > -80) rssi_quality = 40;
    else if (rssi > -90) rssi_quality = 20;
    else rssi_quality = 0;
    
    // Reduce quality based on packet loss
    uint8_t loss_penalty = (packet_loss_rate > 100) ? 100 : packet_loss_rate;
    rssi_quality = (rssi_quality > loss_penalty) ? (rssi_quality - loss_penalty) : 0;
    
    return rssi_quality;
}

void SAMD21TelemetryIntegration::initialize_pins()
{
    // Initialize status LEDs
    pinMode(TEL_LED_RED_PIN, OUTPUT);
    pinMode(TEL_LED_GREEN_PIN, OUTPUT);
    pinMode(TEL_LED_BLUE_PIN, OUTPUT);
    
    // Initialize radio control pins
    pinMode(TEL_RADIO_ENABLE_PIN, OUTPUT);
    pinMode(TEL_RADIO_RESET_PIN, OUTPUT);
    pinMode(TEL_RADIO_CONFIG_PIN, OUTPUT);
    pinMode(TEL_RADIO_STATUS_PIN, INPUT);
    pinMode(TEL_ANTENNA_SELECT_PIN, OUTPUT);
    pinMode(TEL_PA_ENABLE_PIN, OUTPUT);
    pinMode(TEL_LNA_ENABLE_PIN, OUTPUT);
    
    // Initialize SPI pins
    pinMode(TEL_SPI_MOSI_PIN, INPUT);  // Slave MOSI is input
    pinMode(TEL_SPI_MISO_PIN, OUTPUT); // Slave MISO is output
    pinMode(TEL_SPI_SCK_PIN, INPUT);   // Slave SCK is input
    pinMode(TEL_SPI_CS_PIN, INPUT);    // Slave CS is input
    
    // Enable radio
    digitalWrite(TEL_RADIO_ENABLE_PIN, HIGH);
    digitalWrite(TEL_PA_ENABLE_PIN, HIGH);
    digitalWrite(TEL_LNA_ENABLE_PIN, HIGH);
    digitalWrite(TEL_ANTENNA_SELECT_PIN, LOW); // Select antenna 0
    
    // Reset radio
    digitalWrite(TEL_RADIO_RESET_PIN, LOW);
    delay(10);
    digitalWrite(TEL_RADIO_RESET_PIN, HIGH);
    delay(100);
}

void SAMD21TelemetryIntegration::configure_uart()
{
    // Configure Serial1 for radio communication
    Serial1.begin(57600); // High-speed UART for radio
}

