7FULL/SIDERA/src/samd21_telemetry/src/samd21_telemetry_integration.cpp
void SAMD21TelemetryIntegration::initialize_radio_profiles()
{
    // Long range LoRa profile
    radio_profiles[0] = {
        .name = "Long Range",
        .frequency = 433000000,    // 433 MHz
        .power_level = 100,        // 100% power
        .data_rate = 1200,         // 1.2 kbps
        .modulation = 0,           // LoRa modulation
        .use_encryption = true,
        .use_fec = true,
        .max_range_km = 50.0f
    };
    
    // High speed profile
    radio_profiles[1] = {
        .name = "High Speed",
        .frequency = 2400000000,   // 2.4 GHz
        .power_level = 80,         // 80% power
        .data_rate = 115200,       // 115.2 kbps
        .modulation = 1,           // FSK modulation
        .use_encryption = false,
        .use_fec = false,
        .max_range_km = 5.0f
    };
    
    // Low power profile
    radio_profiles[2] = {
        .name = "Low Power",
        .frequency = 433000000,    // 433 MHz
        .power_level = 30,         // 30% power
        .data_rate = 300,          // 300 bps
        .modulation = 0,           // LoRa modulation
        .use_encryption = true,
        .use_fec = true,
        .max_range_km = 20.0f
    };
    
    // Emergency profile
    radio_profiles[3] = {
        .name = "Emergency",
        .frequency = 433000000,    // 433 MHz
        .power_level = 100,        // 100% power
        .data_rate = 600,          // 600 bps
        .modulation = 0,           // LoRa modulation
        .use_encryption = false,   // No encryption for emergency
        .use_fec = true,
        .max_range_km = 100.0f
    };
}

// Namespace implementations
namespace TelemetryUtils {
    // Radio profiles
    const RadioProfile LONG_RANGE_PROFILE = {
        .name = "Long Range",
        .frequency = 433000000,
        .power_level = 100,
        .data_rate = 1200,
        .modulation = 0,
        .use_encryption = true,
        .use_fec = true,
        .max_range_km = 50.0f
    };
    
    const RadioProfile HIGH_SPEED_PROFILE = {
        .name = "High Speed", 
        .frequency = 2400000000,
        .power_level = 80,
        .data_rate = 115200,
        .modulation = 1,
        .use_encryption = false,
        .use_fec = false,
        .max_range_km = 5.0f
    };
    
    const RadioProfile LOW_POWER_PROFILE = {
        .name = "Low Power",
        .frequency = 433000000,
        .power_level = 30,
        .data_rate = 300,
        .modulation = 0,
        .use_encryption = true,
        .use_fec = true,
        .max_range_km = 20.0f
    };
    
    const RadioProfile EMERGENCY_PROFILE = {
        .name = "Emergency",
        .frequency = 433000000,
        .power_level = 100,
        .data_rate = 600,
        .modulation = 0,
        .use_encryption = false,
        .use_fec = true,
        .max_range_km = 100.0f
    };
    
    bool is_command_safe_during_flight(GroundCommand command)
    {
        switch (command) {
            case CMD_ARM_SYSTEM:
            case CMD_DISARM_SYSTEM:
            case CMD_REQUEST_DATA:
            case CMD_SET_PARAMETER:
                return true;
                
            case CMD_DEPLOY_DROGUE:
            case CMD_DEPLOY_MAIN:
            case CMD_ABORT_FLIGHT:
            case CMD_EMERGENCY_STOP:
                return false; // These are dangerous during flight
                
            default:
                return false;
        }
    }
    
    const char* command_to_string(GroundCommand command)
    {
        switch (command) {
            case CMD_ARM_SYSTEM: return "ARM_SYSTEM";
            case CMD_DISARM_SYSTEM: return "DISARM_SYSTEM";
            case CMD_DEPLOY_DROGUE: return "DEPLOY_DROGUE";
            case CMD_DEPLOY_MAIN: return "DEPLOY_MAIN";
            case CMD_ABORT_FLIGHT: return "ABORT_FLIGHT";
            case CMD_SET_PARAMETER: return "SET_PARAMETER";
            case CMD_REQUEST_DATA: return "REQUEST_DATA";
            case CMD_START_LOGGING: return "START_LOGGING";
            case CMD_STOP_LOGGING: return "STOP_LOGGING";
            case CMD_EMERGENCY_STOP: return "EMERGENCY_STOP";
            default: return "UNKNOWN";
        }
    }
    
    LinkAnalysis analyze_link_quality(int8_t rssi, uint32_t packets_sent, uint32_t packets_lost)
    {
        LinkAnalysis analysis;
        
        analysis.signal_strength_dbm = rssi;
        analysis.noise_floor_dbm = -100.0f; // Assumed noise floor
        analysis.snr_db = rssi - analysis.noise_floor_dbm;
        
        if (analysis.snr_db > 20) analysis.link_margin_db = 20;
        else if (analysis.snr_db > 0) analysis.link_margin_db = (uint8_t)analysis.snr_db;
        else analysis.link_margin_db = 0;
        
        if (packets_sent > 0) {
            analysis.packet_error_rate = (float)packets_lost / packets_sent;
        } else {
            analysis.packet_error_rate = 0.0f;
        }
        
        analysis.link_stable = (analysis.packet_error_rate < 0.1f && analysis.snr_db > 10.0f);
        
        return analysis;
    }
}